In [1]:
import pandas as pd

In [2]:
f1=pd.read_excel(r"C:\Users\priya\OneDrive\Desktop\Intern\test_task2.2.xlsx")

In [3]:
f1.head()

               Specialty     IMC    Misc
0   General Registration  406262  GP Reg
1   General Registration  406262  GP Reg
2   General Registration  357302     NaN
3   General Registration   21569     NaN
4   General Registration  336686     NaN

In [4]:
f1.drop_duplicates(subset ="IMC",
                     keep = "first", inplace = True)

In [5]:
f1.head()

               Specialty     IMC    Misc
0   General Registration  406262  GP Reg
2   General Registration  357302     NaN
3   General Registration   21569     NaN
4   General Registration  336686     NaN
5   General Registration   13196     NaN

In [6]:
f1['Misc'] = f1['Misc'].fillna(0)

In [7]:
f1.head()

               Specialty     IMC    Misc
0   General Registration  406262  GP Reg
2   General Registration  357302       0
3   General Registration   21569       0
4   General Registration  336686       0
5   General Registration   13196       0

In [8]:
f1 = f1[f1['Misc'] != 'GP Reg']

In [9]:
f1.head()

               Specialty     IMC Misc
2   General Registration  357302    0
3   General Registration   21569    0
4   General Registration  336686    0
5   General Registration   13196    0
6   General Registration  405094    0

In [10]:
for i in f1:
    print(f1[i].values)

[' General Registration' ' General Registration' ' General Registration'
 ' General Registration' ' General Registration' ' General Registration'
 ' General Registration' ' General Registration' ' General Registration'
 ' General Registration' ' General Registration' ' General Registration'
 ' General Registration' ' General Registration' ' General Registration'
 ' General Registration' ' General Registration' ' General Registration'
 ' General Registration' ' General Registration' 'General Registration'
 'General Registration' 'General Registration' 'General Registration'
 'General Registration' 'General Registration' 'General Registration'
 'General Registration' 'General Registration' 'General Registration'
 'General Registration' 'General Registration' 'General Registration'
 'General Registration' 'General Registration' 'General Registration'
 'General Registration' 'Specialist Registration'
 'Specialist Registration' 'Specialist Registration'
 'Specialist Registration' 'Specialist Registration'
 'Specialist Registration' 'Trainee Specialist Registration'
 'Trainee Specialist Registration' 'Trainee Specialist Registration'
 'Trainee Specialist Registration' 'Trainee Specialist Registration'
 'Trainee Specialist Registration']
[357302  21569 336686  13196 405094  58397 418004 400391 417063  22196
 412340 110662  16197   5025   9524   3951  14327   7772  13109   3746
    829  16203  18494 400463  19044  12401   5156 400219  12203 345475
 291053 402332  11615  19345  11284 412771   1509   6184   3949   8948
   4702   5106 403451 414652 371484 400731 417934 411522 423717]
[0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
 0 0 0 0 0 0 0 0 0 0 0 0]

In [11]:
f1['Misc']=f1['IMC']

In [12]:
f1.head()

               Specialty     IMC    Misc
2   General Registration  357302  357302
3   General Registration   21569   21569
4   General Registration  336686  336686
5   General Registration   13196   13196
6   General Registration  405094  405094